#+TITLE: Baccam — Default Loss vs Log-Likelihood Loss
#+AUTHOR: Ramakrishna Suresh
#+PROPERTY: header-args:julia-vterm :session *julia* :results output :exports both :dir (projectile-project-root) :tangle yes :comments both
#+STARTUP: inlineimages overview

* Baccam model — true ODE and noisy data

#+begin_src julia-vterm

function Baccam_model!(du, u, p, t)
    T, I, V = u
    du[1] = -p.β * T * V
    du[2] =  p.β * T * V - p.δ * I
    du[3] =  p.p * I     - p.c * V
end

bac_true_params = (β = 2.7f-5, δ = 4.0f0, p = 1.2f-2, c = 3.0f0)
bac_u0     = Float32[4.0f8, 0.0f0, 9.3f-2]
bac_t_span = (0.0f0, 8.0f0)
bac_t_fine = collect(range(bac_t_span[1], bac_t_span[2], length = 2001))

bac_sol = solve(
    ODEProblem(Baccam_model!, bac_u0, bac_t_span, bac_true_params),
    Tsit5(); saveat = bac_t_fine
)
bac_sol_array = Array(bac_sol)

println("Baccam ODE solved: $(size(bac_sol_array))")
#+end_src

#+RESULTS:
: Baccam ODE solved: (3, 2001)

#+begin_src julia-vterm

rng_bac = MersenneTwister(42)
bac_noise_σ = 0.5f0
bac_n_tp    = 10
bac_n_mice  = 12

bac_idx   = round.(Int, range(1, length(bac_t_fine), length = bac_n_tp))
bac_t_obs = Float32.(bac_t_fine[bac_idx])
bac_Y_true = Float32.(bac_sol_array[:, bac_idx])

bac_ε = randn(rng_bac, Float32, 3, bac_n_tp, bac_n_mice)
bac_Y_noisy = clamp.(
    bac_Y_true .* exp.(bac_noise_σ .* bac_ε .- 0.5f0 * bac_noise_σ^2),
    0f0, Inf32
)
bac_Y_mean = dropdims(mean(bac_Y_noisy; dims = 3); dims = 3)

# Flattened (state × (n_tp · n_mice)) noisy dataset for the NLL rows.
# Built via index comprehensions that walk (tp, mouse) in identical order
# for both arrays, so the (t, y) pairing cannot drift regardless of
# Julia's column-major conventions. Avoids the reshape+repeat pattern,
# which silently mis-pairs values when `inner` and `outer` are confused.
bac_Y_flat = Float32.(hcat([
    [bac_Y_noisy[s, k, m] for s in 1:3]
    for k in 1:bac_n_tp, m in 1:bac_n_mice
]...))                                       # 3 × (n_tp · n_mice)
bac_t_flat = Float32.([bac_t_obs[k]
    for k in 1:bac_n_tp, m in 1:bac_n_mice])  |> vec   # length n_tp · n_mice

println("Baccam training data: $(bac_n_tp) timepoints × $(bac_n_mice) mice")
println("  default rows train on means     : 3 × $(bac_n_tp) = $(3*bac_n_tp) values")
println("  NLL rows train on full dataset  : 3 × $(bac_n_tp * bac_n_mice) = $(3*bac_n_tp*bac_n_mice) values")
#+end_src

#+RESULTS:
: Baccam training data: 10 timepoints × 12 mice
:   default rows train on means     : 3 × 10 = 30 values
:   NLL rows train on full dataset  : 3 × 120 = 360 values

